"""
Головний скрипт, що демонструє використання функцій з
'math_utils.py' та 'string_utils.py'
"""

# Імпортуємо функції з модулів
from math_utils import *
from string_utils import *

# Приклад застовуання функцій з модулів
print(factorial(7))  # Визначаємо факторіал числа
print(gcd(6, 3333))  # Знаходження найбільшого спільного дільника двох чисел
print(upper("hello"))  # Перетворення тексту в верхній регістр
print(strip("                    Text with more spaces"))  # Видалення пробілів на початку та в кінці рядка
